spec/cassettes/InvoicePayment_StripeCheckoutFailed/_process/creates_the_payment_entry.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/accounts
    body:
      encoding: UTF-8
      string: type=standard
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/8.2.0
      Authorization:
      - Bearer sk_test_51EXIAiEQYiNu1q8E22PeN6N5pMswpv0Q5dwRApDrqfIuGvyoKTCX5KaKdWWIEZht8LjSF85v7lxPOKrxBFFs7vLp00QvWOAKgM
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_VxvFJY5mDHqxPH","request_duration_ms":1}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"8.2.0","lang":"ruby","lang_version":"3.2.2 p53 (2023-03-30)","platform":"x86_64-darwin22","engine":"ruby","publisher":"stripe","uname":"Darwin
        Gowsik-ka-MacBook-Pro.local 22.2.0 Darwin Kernel Version 22.2.0: Fri Nov 11
        02:08:47 PST 2022; root:xnu-8792.61.2~4/RELEASE_X86_64 x86_64","hostname":"Gowsik-ka-MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 13 Jun 2023 12:09:24 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2825'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - 6e7e697b-4249-49dc-ac97-4c596e22ad9f
      Original-Request:
      - req_yUtcz94wVYFWXy
      Request-Id:
      - req_yUtcz94wVYFWXy
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2019-03-14'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "acct_1NIW2JEFSBh0Ah6V",
          "object": "account",
          "business_profile": {
            "mcc": null,
            "name": null,
            "product_description": null,
            "support_address": null,
            "support_email": null,
            "support_phone": null,
            "support_url": null,
            "url": null
          },
          "business_type": null,
          "capabilities": {},
          "charges_enabled": false,
          "controller": {
            "is_controller": true,
            "type": "application"
          },
          "country": "US",
          "created": 1686658163,
          "default_currency": "usd",
          "details_submitted": false,
          "email": null,
          "external_accounts": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/accounts/acct_1NIW2JEFSBh0Ah6V/external_accounts"
          },
          "future_requirements": {
            "alternatives": [],
            "current_deadline": null,
            "currently_due": [],
            "disabled_reason": null,
            "errors": [],
            "eventually_due": [],
            "past_due": [],
            "pending_verification": []
          },
          "metadata": {},
          "payouts_enabled": false,
          "requirements": {
            "alternatives": [],
            "current_deadline": null,
            "currently_due": [
              "business_profile.product_description",
              "business_profile.support_phone",
              "business_profile.url",
              "external_account",
              "tos_acceptance.date",
              "tos_acceptance.ip"
            ],
            "disabled_reason": "requirements.past_due",
            "errors": [],
            "eventually_due": [
              "business_profile.product_description",
              "business_profile.support_phone",
              "business_profile.url",
              "external_account",
              "tos_acceptance.date",
              "tos_acceptance.ip"
            ],
            "past_due": [
              "external_account",
              "tos_acceptance.date",
              "tos_acceptance.ip"
            ],
            "pending_verification": []
          },
          "settings": {
            "bacs_debit_payments": {},
            "branding": {
              "icon": null,
              "logo": null,
              "primary_color": null,
              "secondary_color": null
            },
            "card_issuing": {
              "tos_acceptance": {
                "date": null,
                "ip": null
              }
            },
            "card_payments": {
              "decline_on": {
                "avs_failure": true,
                "cvc_failure": true
              },
              "statement_descriptor_prefix": null,
              "statement_descriptor_prefix_kana": null,
              "statement_descriptor_prefix_kanji": null
            },
            "dashboard": {
              "display_name": null,
              "timezone": "Etc/UTC"
            },
            "payments": {
              "statement_descriptor": null,
              "statement_descriptor_kana": null,
              "statement_descriptor_kanji": null
            },
            "payouts": {
              "debit_negative_balances": true,
              "schedule": {
                "delay_days": 2,
                "interval": "daily"
              },
              "statement_descriptor": null
            },
            "sepa_debit_payments": {}
          },
          "tos_acceptance": {
            "date": null,
            "ip": null,
            "user_agent": null
          },
          "type": "standard"
        }
  recorded_at: Tue, 13 Jun 2023 12:09:24 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=barry%40example.org&name=Shavonda+Jacobi&phone=%2B9939976054328&metadata[platform_id]=4
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/8.2.0
      Authorization:
      - Bearer sk_test_51EXIAiEQYiNu1q8E22PeN6N5pMswpv0Q5dwRApDrqfIuGvyoKTCX5KaKdWWIEZht8LjSF85v7lxPOKrxBFFs7vLp00QvWOAKgM
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_yUtcz94wVYFWXy","request_duration_ms":1743}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"8.2.0","lang":"ruby","lang_version":"3.2.2 p53 (2023-03-30)","platform":"x86_64-darwin22","engine":"ruby","publisher":"stripe","uname":"Darwin
        Gowsik-ka-MacBook-Pro.local 22.2.0 Darwin Kernel Version 22.2.0: Fri Nov 11
        02:08:47 PST 2022; root:xnu-8792.61.2~4/RELEASE_X86_64 x86_64","hostname":"Gowsik-ka-MacBook-Pro.local"}'
      Stripe-Account:
      - acct_1NIU5SENZof8Gnl1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 13 Jun 2023 12:09:25 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1268'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - 14a971be-0c6a-48a6-99d9-e5e80ec86528
      Original-Request:
      - req_ANqtPlAab9vLwu
      Request-Id:
      - req_ANqtPlAab9vLwu
      Stripe-Account:
      - acct_1NIU5SENZof8Gnl1
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2019-03-14'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "cus_O4fNIC70bvQd3Q",
          "object": "customer",
          "account_balance": 0,
          "address": null,
          "balance": 0,
          "created": 1686658164,
          "currency": null,
          "default_currency": null,
          "default_source": null,
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "barry@example.org",
          "invoice_prefix": "C6E7D894",
          "invoice_settings": {
            "custom_fields": null,
            "default_payment_method": null,
            "footer": null,
            "rendering_options": null
          },
          "livemode": false,
          "metadata": {
            "platform_id": "4"
          },
          "name": "Shavonda Jacobi",
          "next_invoice_sequence": 1,
          "phone": "+9939976054328",
          "preferred_locales": [],
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_O4fNIC70bvQd3Q/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_O4fNIC70bvQd3Q/subscriptions"
          },
          "tax_exempt": "none",
          "tax_ids": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_O4fNIC70bvQd3Q/tax_ids"
          },
          "tax_info": null,
          "tax_info_verification": null,
          "test_clock": null
        }
  recorded_at: Tue, 13 Jun 2023 12:09:25 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/checkout/sessions
    body:
      encoding: UTF-8
      string: line_items[0][price_data][currency]=inr&line_items[0][price_data][product_data][name]=nmjy&line_items[0][price_data][product_data][description]=Invoice+from+Saeloun+for+inr+99957.57+due+on+2022-06-08&line_items[0][price_data][unit_amount]=9995757&line_items[0][quantity]=1&mode=payment&customer=cus_O4fNIC70bvQd3Q&success_url=https%3A%2F%2Fexample.com%2Finvoices%2F4%2Fpayments%2Fsuccess&cancel_url=https%3A%2F%2Fexample.com%2Finvoices%2F4%2Fpayments%2Fcancel&metadata[invoice_id]=4
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/8.2.0
      Authorization:
      - Bearer sk_test_51EXIAiEQYiNu1q8E22PeN6N5pMswpv0Q5dwRApDrqfIuGvyoKTCX5KaKdWWIEZht8LjSF85v7lxPOKrxBFFs7vLp00QvWOAKgM
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_ANqtPlAab9vLwu","request_duration_ms":533}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"8.2.0","lang":"ruby","lang_version":"3.2.2 p53 (2023-03-30)","platform":"x86_64-darwin22","engine":"ruby","publisher":"stripe","uname":"Darwin
        Gowsik-ka-MacBook-Pro.local 22.2.0 Darwin Kernel Version 22.2.0: Fri Nov 11
        02:08:47 PST 2022; root:xnu-8792.61.2~4/RELEASE_X86_64 x86_64","hostname":"Gowsik-ka-MacBook-Pro.local"}'
      Stripe-Account:
      - acct_1NIU5SENZof8Gnl1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 13 Jun 2023 12:09:26 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2314'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - 10b0bf35-40b4-41ee-a7bd-e2b49ef5d645
      Original-Request:
      - req_zUvocUXndyaASY
      Request-Id:
      - req_zUvocUXndyaASY
      Stripe-Account:
      - acct_1NIU5SENZof8Gnl1
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2019-03-14'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "cs_test_a1uA8EURMD8PL8Np5PFJtqH1TM8xdW34wpdUh63CFGafm6PsfiJlyGkZTU",
          "object": "checkout.session",
          "after_expiration": null,
          "allow_promotion_codes": null,
          "amount_subtotal": 9995757,
          "amount_total": 9995757,
          "automatic_tax": {
            "enabled": false,
            "status": null
          },
          "billing_address_collection": null,
          "cancel_url": "https://example.com/invoices/4/payments/cancel",
          "client_reference_id": null,
          "consent": null,
          "consent_collection": null,
          "created": 1686658165,
          "currency": "inr",
          "currency_conversion": null,
          "custom_fields": [],
          "custom_text": {
            "shipping_address": null,
            "submit": null
          },
          "customer": "cus_O4fNIC70bvQd3Q",
          "customer_creation": null,
          "customer_details": {
            "address": null,
            "email": "barry@example.org",
            "name": null,
            "phone": null,
            "tax_exempt": "none",
            "tax_ids": null
          },
          "customer_email": null,
          "expires_at": 1686744565,
          "invoice": null,
          "invoice_creation": {
            "enabled": false,
            "invoice_data": {
              "account_tax_ids": null,
              "custom_fields": null,
              "description": null,
              "footer": null,
              "metadata": {},
              "rendering_options": null
            }
          },
          "livemode": false,
          "locale": null,
          "metadata": {
            "invoice_id": "4"
          },
          "mode": "payment",
          "payment_intent": "pi_3NIW2LENZof8Gnl11C9f2xSp",
          "payment_link": null,
          "payment_method_collection": "always",
          "payment_method_options": {},
          "payment_method_types": [
            "card"
          ],
          "payment_status": "unpaid",
          "phone_number_collection": {
            "enabled": false
          },
          "recovered_from": null,
          "setup_intent": null,
          "shipping": null,
          "shipping_address_collection": null,
          "shipping_options": [],
          "shipping_rate": null,
          "status": "open",
          "submit_type": null,
          "subscription": null,
          "success_url": "https://example.com/invoices/4/payments/success",
          "total_details": {
            "amount_discount": 0,
            "amount_shipping": 0,
            "amount_tax": 0
          },
          "url": "https://checkout.stripe.com/c/pay/cs_test_a1uA8EURMD8PL8Np5PFJtqH1TM8xdW34wpdUh63CFGafm6PsfiJlyGkZTU#fidkdWxOYHwnPyd1blpxYHZxWktKYmZuSTFHUTE1ZGJibExXSGxQPUo3YjU1fG1UfXU0fFYnKSdjd2poVmB3c2B3Jz9xd3BgKSdpZHxqcHFRfHVgJz8ndmxrYmlgWmxxYGgnKSdga2RnaWBVaWRmYG1qaWFgd3YnP3F3cGApJ3Zxd2x1YERmZmpwa3EnPydkZmZxWjRLTFAwVkBLX2pjPUJraTQneCUl"
        }
  recorded_at: Tue, 13 Jun 2023 12:09:26 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/checkout/sessions/cs_test_a1uA8EURMD8PL8Np5PFJtqH1TM8xdW34wpdUh63CFGafm6PsfiJlyGkZTU/expire
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/8.2.0
      Authorization:
      - Bearer sk_test_51EXIAiEQYiNu1q8E22PeN6N5pMswpv0Q5dwRApDrqfIuGvyoKTCX5KaKdWWIEZht8LjSF85v7lxPOKrxBFFs7vLp00QvWOAKgM
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_zUvocUXndyaASY","request_duration_ms":902}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"8.2.0","lang":"ruby","lang_version":"3.2.2 p53 (2023-03-30)","platform":"x86_64-darwin22","engine":"ruby","publisher":"stripe","uname":"Darwin
        Gowsik-ka-MacBook-Pro.local 22.2.0 Darwin Kernel Version 22.2.0: Fri Nov 11
        02:08:47 PST 2022; root:xnu-8792.61.2~4/RELEASE_X86_64 x86_64","hostname":"Gowsik-ka-MacBook-Pro.local"}'
      Stripe-Account:
      - acct_1NIU5SENZof8Gnl1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 13 Jun 2023 12:09:27 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1994'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - c2a59e31-7c17-43a7-ad47-7fc4418fd8c1
      Original-Request:
      - req_U7vzghadMpcPKH
      Request-Id:
      - req_U7vzghadMpcPKH
      Stripe-Account:
      - acct_1NIU5SENZof8Gnl1
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2019-03-14'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "cs_test_a1uA8EURMD8PL8Np5PFJtqH1TM8xdW34wpdUh63CFGafm6PsfiJlyGkZTU",
          "object": "checkout.session",
          "after_expiration": null,
          "allow_promotion_codes": null,
          "amount_subtotal": 9995757,
          "amount_total": 9995757,
          "automatic_tax": {
            "enabled": false,
            "status": null
          },
          "billing_address_collection": null,
          "cancel_url": "https://example.com/invoices/4/payments/cancel",
          "client_reference_id": null,
          "consent": null,
          "consent_collection": null,
          "created": 1686658165,
          "currency": "inr",
          "currency_conversion": null,
          "custom_fields": [],
          "custom_text": {
            "shipping_address": null,
            "submit": null
          },
          "customer": "cus_O4fNIC70bvQd3Q",
          "customer_creation": null,
          "customer_details": {
            "address": null,
            "email": "barry@example.org",
            "name": null,
            "phone": null,
            "tax_exempt": "none",
            "tax_ids": null
          },
          "customer_email": null,
          "expires_at": 1686744565,
          "invoice": null,
          "invoice_creation": {
            "enabled": false,
            "invoice_data": {
              "account_tax_ids": null,
              "custom_fields": null,
              "description": null,
              "footer": null,
              "metadata": {},
              "rendering_options": null
            }
          },
          "livemode": false,
          "locale": null,
          "metadata": {
            "invoice_id": "4"
          },
          "mode": "payment",
          "payment_intent": "pi_3NIW2LENZof8Gnl11C9f2xSp",
          "payment_link": null,
          "payment_method_collection": "always",
          "payment_method_options": {},
          "payment_method_types": [
            "card"
          ],
          "payment_status": "unpaid",
          "phone_number_collection": {
            "enabled": false
          },
          "recovered_from": null,
          "setup_intent": null,
          "shipping": null,
          "shipping_address_collection": null,
          "shipping_options": [],
          "shipping_rate": null,
          "status": "expired",
          "submit_type": null,
          "subscription": null,
          "success_url": "https://example.com/invoices/4/payments/success",
          "total_details": {
            "amount_discount": 0,
            "amount_shipping": 0,
            "amount_tax": 0
          },
          "url": null
        }
  recorded_at: Tue, 13 Jun 2023 12:09:27 GMT
recorded_with: VCR 6.1.0
